app/controllers/mail_pieces_controller.rb

  def index

    @mail_client = MailClient.find(params[:mail_client_id])
    @mail_pieces = @mail_client.mail_pieces.all
---
SELECT * FROM `mail_clients` WHERE (`mail_clients`.`id` = 1)
SELECT * FROM `mail_pieces` WHERE (`mail_pieces`.mail_client_id = 1) ORDER BY usps_drop_date

  def show
    @mail_piece = MailPiece.find(params[:id])
---
SELECT * FROM `mail_pieces` WHERE (`mail_pieces`.`id` = 1)

  def new

    @mail_client = MailClient.find(params[:mail_client_id])
---
SELECT * FROM `mail_clients` WHERE (`mail_clients`.`id` = 1)

  def edit
    @mail_piece = MailPiece.find(params[:id])
---
SELECT * FROM `mail_pieces` WHERE (`mail_pieces`.`id` = 1)

  def create

    @mail_client = MailClient.find(params[:mail_client_id])
    @mail_piece = @mail_client.mail_pieces.build(params[:mail_piece])

    respond_to do |format|
      if @mail_piece.save
---
SELECT * FROM `mail_clients` WHERE (`mail_clients`.`id` = 1)
INSERT INTO `mail_pieces` (`created_at`, `updated_at`, `mail_client_id`, `piece_name`, `piece_code`, `mail_universe_description`, `household_quantity_estimate`, `voter_count`, `list_name`, `date_to_printer`, `target_hit_date`, `actual_hit_date`, `payment_description`, `final_status`, `have_invoice`, `expected_drop_date`, `usps_drop_date`, `order_qty`, `current_status`, `gang_name`) VALUES('2010-07-24 20:03:50', '2010-07-24 20:03:50', 1, '', '', '', NULL, NULL, '', '2010-07-24', '2010-07-24', '2010-07-24', '', '', 0, '2010-07-24', '2010-07-24', NULL, '', 'Piece 3')

  def update
    @mail_piece = MailPiece.find(params[:id])

    respond_to do |format|
      if @mail_piece.update_attributes(params[:mail_piece])
---
SELECT * FROM `mail_pieces` WHERE (`mail_pieces`.`id` = 1)
UPDATE `mail_pieces` SET `current_status` = '', `usps_drop_date` = '2010-07-10', `updated_at` = '2010-07-24 17:28:54' WHERE `id` = 3