app/controllers/mail_pieces_controller.rb

SELECT `mail_pieces`.* FROM `mail_pieces` INNER JOIN `mail_clients` ON `mail_clients`.id = `mail_pieces`.mail_client_id ORDER BY last_name ASC, usps_drop_date ASC
---
  def index
    if is_logged_in?

      @mail_pieces = MailPiece.all :joins => :mail_client, :order => "last_name ASC, usps_drop_date ASC"