app/controllers/mail_clients_controller.rb

  def index

    if is_logged_in?

      @mail_clients = MailClient.all(:order => "last_name ASC, first_name ASC")
---
SELECT * FROM `mail_clients` ORDER BY last_name ASC, first_name ASC

  def show

    if is_logged_in?
      @mail_client = MailClient.find(params[:id])
---
SELECT * FROM `mail_clients` WHERE (`mail_clients`.`id` = 1)

  def edit
    if is_logged_in?
      @mail_client = MailClient.find(params[:id])
---
SELECT * FROM `mail_clients` WHERE (`mail_clients`.`id` = 1)

  def create
    if is_logged_in?

      @mail_client = MailClient.new(params[:mail_client])

      respond_to do |format|
        if @mail_client.save
---
INSERT INTO `mail_clients` (`created_at`, `updated_at`, `first_name`, `last_name`, `district_number`) VALUES('2010-07-23 00:18:56', '2010-07-23 00:18:56', 'Rob', 'Recalde', 1)

  def update

    if is_logged_in?

      @mail_client = MailClient.find(params[:id])
---
SELECT * FROM `mail_clients` WHERE (`mail_clients`.`id` = 1)