app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `first_name`, `last_name`, `email`, `crypted_password`, `password_salt`, `persistence_token`, `single_access_token`, `perishable_token`, `login_count`, `failed_login_count`, `last_request_at`, `current_login_at`, `last_login_at`, `current_login_ip`, `last_login_ip`) VALUES('rob', 'Rob', 'Recalde', 'recalde@gmail.com', '85d8dfa048d1d77e66d330701d8d9cf65e8d7a035675ab982b45a99031b93ca25f60a1f1e73a14cb0efa9ac06bdf59c36612397c6a251c912e1942d9d7cc95e1', 'eFIoQZZfuKIZ_JgrxEYs', '4d5ab0c706aa5c9daacf252845144f7ddeeb28e4919d80b08e815e4a292f281f5db18b951686ec0a86e7c7f157fc81ea967656e706fe11d5de95171503d5a73c', 'DbRlVAcX_PUcEmXDMcaI', 'KHd95sGL7IDbLrLlkGoI', 1, 0, '2010-07-23 20:04:52', '2010-07-23 20:04:52', NULL, '0:0:0:0:0:0:0:1', NULL)
---
  def create

    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save